[
    {
      "title": "Travel Planning App",
      "subtitle": "INFO 340 Final Project",
      "technologies": ["React", "JavaScript", "Firebase", "HTML", "CSS"],
      "description": "Developed a full-stack travel planning aplication, with integrated Firebase authentication and storage for user data and data uploads like photos.",
      "imagePath": "/img/travel-planner.png",
      "link": "https://travelplanner-8290b.web.app/signin",
      "githubLink": "https://github.com/info340-su24/project-gardnas"
    },
    {
      "title": "Eat Together App",
      "subtitle": "Full-stack developer",
      "technologies": ["React Native", "JavaScript", "Figma"],
      "description": "Eat Together is an app that focuses on bringing college students together through food realted meetups. It aims to solve the difficulty for new or existing college students to meet each other through food and culture. As a developer on the Eat Together team, one of my main projects was developing and designing a Would You Rather? game to be integrated into the app for users to play at meals.",
      "imagePath": "/img/eat-together.png",
      "link": "https://www.eat-together.tech/",
      "githubLink": "https://github.com/eat-together-team/eat-together"
    },
    {
      "title": "Husky Maps",
      "subtitle": "CSE 373 (Data Structures and Algorithims) & Personal Project",
      "technologies": ["Java"],
      "description": "Husky Maps is an interactive mapping application specifically designed for navigating Seattle. Originally developed as part of the CSE 373 (Data Structures and Algorithms) course, I have since been expanded to include new features such as enhanced place search, optimized routing accounting for accessibility, and real-time navigation(coming soon).",
      "imagePath": "/img/husky-maps.png",
      "link": "TBD",
      "githubLink": "https://github.com/myusername/portfolio-website"
    },
    {
      "title": "NBA Shot Data and Player Analysis (2004, 2014, 2023)",
      "subtitle": "CSE 163 (Intermediate Data Programming)",
      "technologies": ["Python", "Scikit-learn", "Pandas", "Matplotlib","Seaborn","Plotly","Jupyter"],
      "description": "This data analysis project examines key performance trends among top NBA players in 2004, 2014, and 2023. Using data scraping, statistical analysis, and visualizations, the project explores common traits among the top players, changes in shot locations, and shifts in player stats over time. Key findings include an increase in 3-point shooting, improved player accuracy, and well-rounded performance across points, assists, and rebounds.",
      "imagePath": "/img/heat-map.jpeg",
      "link": "https://docs.google.com/presentation/d/1Q2suyvCAg1ECfc4RdX_DcNHWTe4-tn0R-7Bx_EzcHjM/edit?usp=sharing",
      "githubLink": "https://github.com/gardnas/NBA-shot-data-analysis"
    },
    {
      "title": "Terrain Generator Simulation",
      "subtitle": "Personal Project",
      "technologies": ["Java", "Processing"],
      "description": "This project is a 3D terrain generator simulation built using Processing, which creates a dynamic and realistic landscape based on Perlin noise. The program continuously generates a terrain grid by mapping noise values to elevation heights, allowing for smooth and natural variations in the terrain. As the simulation progresses, the terrain appears to fly forward, providing a sense of movement and depth. The visualization uses 3D rendering techniques, including rotation and translation, to give the user an immersive view of the generated landscape.",
      "imagePath": "/img/Terrain.png",
      "link": "TBD",
      "githubLink": "https://github.com/gardnas/TerrainGen"
    }
  ]
  